# Makefile для сборки проекта Go

# Название исполняемого файла, которое будет создано
EXECUTABLE_NAME := urlcutter

# Путь к главному файлу (пакету), который нужно скомпилировать
MAIN_PACKAGE := ./

# Директория для исполняемых файлов
BUILD_DIR := bin

# Полный путь к итоговому исполняемому файлу
OUTPUT_PATH := $(BUILD_DIR)/$(EXECUTABLE_NAME)

.PHONY: build clean test

# ----------------------------------------------------------------
# Цель: build
# Сборка Go-проекта и размещение исполняемого файла в директории bin
# ----------------------------------------------------------------
build: $(BUILD_DIR)
	@echo "--- Сборка проекта Go: $(MAIN_PACKAGE) в $(OUTPUT_PATH) ---"
	# -o: указывает путь и имя выходного файла
	# $(MAIN_PACKAGE): указывает путь к главному пакету
	go build -o $(OUTPUT_PATH) $(MAIN_PACKAGE)
	@echo "Сборка завершена. Исполняемый файл: $(OUTPUT_PATH)"

# Цель для создания директории bin, если она отсутствует
$(BUILD_DIR):
	@mkdir -p $(BUILD_DIR)

# ----------------------------------------------------------------
# Цель: test
# Запуск юнит тестов проекта
# ----------------------------------------------------------------
test:
	@echo "--- Запуск тестов ---"
	go test -v ./... -race
	@echo "Тесты завершены."

# ----------------------------------------------------------------
# Цель: clean
# Удаление собранных артефактов
# ----------------------------------------------------------------
clean:
	@echo "--- Удаление директории сборки ($(BUILD_DIR)) ---"
	# -f: игнорировать несуществующие файлы и аргументы
	rm -rf $(BUILD_DIR)
	@echo "Очистка завершена."